export const MAX_LETTER_SCORE_MULTIPLIER = 3;
export const POINTS_FOR_BINGO = 50; // 0 disables bingo completely
export const BINGO_NAME = "Bingo";
export const MINIMUM_LETTERS_FOR_BINGO = 7;
export const WORD_SCORE_MULTIPLIERS = {
  double: 2,
  triple: 3
};

export const SCORE_TABLE = {
  deu: {
    displayName: "Deutsch",
    0: [" "],
    1: ["E", "N", "S", "I", "R", "T", "U", "A", "D"],
    2: ["H", "G", "L", "O"],
    3: ["M", "B", "W", "Z"],
    4: ["C", "F", "K", "P"],
    6: ["Ä", "J", "Ü", "V"],
    8: ["Ö", "X"],
    10: ["Q", "Y"]
  },
  gwi: {
    displayName: "Dinju Zhuh Kʼyuu", // Gwichʼin language
    multigraphs: [
      ["A", "I", "I"],
      ["A", "Į", "Į"],
      ["T", "T", "H"],
      ["D", "D", "H"],
      ["K", "H", "W"],
      ["S", "H", "R"],
      ["Z", "H", "R"],
      ["A", "A"],
      ["C", "H"],
      ["E", "E"],
      ["Ą", "Ą"],
      ["I", "I"],
      ["Ę", "Ę"],
      ["Į", "Į"],
      ["O", "O"],
      ["Ǫ", "Ǫ"],
      ["T", "H"],
      ["U", "U"],
      ["Ų", "Ų"],
      ["T", "S"],
      ["T", "R"],
      ["D", "H"],
      ["G", "H"],
      ["K", "H"],
      ["S", "H"],
      ["T", "Ł"],
      ["G", "W"],
      ["Z", "H"],
      ["D", "R"],
      ["K", "W"],
      ["D", "L"],
      ["D", "Z"]
    ],
    0: [" "],
    1: ["ʼ", "I", "A", "N", "T", "H", "Ą", "E", "Ę", "Į", "O", "Ǫ", "U", "Ų"],
    2: ["AA", "CH", "EE", "ĄĄ", "II", "ĘĘ", "ĮĮ", "OO", "ǪǪ", "TH", "UU", "ŲŲ"],
    3: ["AII", "AĮĮ", "D", "G", "K", "R", "Y", "S", "TTH", "W"],
    4: ["TS", "L", "Ł", "TR", "DH", "GH", "KH", "SH"],
    5: ["J", "TŁ", "V", "Z"],
    6: ["GW", "ZH", "DR", "KW"],
    7: ["DL", "DDH", "KHW", "SHR"],
    8: ["DZ"],
    9: ["ZHR"],
    10: ["B", "F", "M"]
  },
  eng: {
    displayName: "English",
    0: [" "],
    1: ["E", "A", "I", "O", "N", "R", "T", "L", "S", "U"],
    2: ["D", "G"],
    3: ["B", "C", "M", "P"],
    4: ["F", "H", "V", "W", "Y"],
    5: ["K"],
    8: ["J", "X"],
    10: ["Q", "Z"]
  },
  spa: {
    displayName: "español",
    multigraphs: [
      ["C", "H"],
      ["L", "L"],
      ["R", "R"]
    ],
    0: [" "],
    1: ["A", "E", "O", "I", "S", "N", "R", "U", "L", "T"],
    2: ["D", "G"],
    3: ["C", "B", "M", "P"],
    4: ["H", "F", "V", "Y"],
    5: ["CH", "Q"],
    8: ["J", "LL", "Ñ", "RR", "X"],
    10: ["Z"]
  },
  fra: {
    displayName: "français",
    0: [" "],
    1: ["E", "A", "I", "N", "O", "R", "S", "T", "U", "L"],
    2: ["D", "M", "G"],
    3: ["B", "C", "P"],
    4: ["F", "H", "V"],
    8: ["J", "Q"],
    10: ["K", "W", "X", "Y", "Z"]
  },
  ita: {
    displayName: "italiano",
    0: [" "],
    1: ["O", "A", "I", "E"],
    2: ["C", "R", "S", "T"],
    3: ["L", "M", "N", "U"],
    5: ["B", "D", "F", "P", "V"],
    8: ["G", "H", "Z"],
    10: ["Q"]
  },
  hun: {
    displayName: "magyar",
    multigraphs: [
      ["S", "Z"],
      ["G", "Y"],
      ["N", "Y"],
      ["C", "S"],
      ["L", "Y"],
      ["Z", "S"],
      ["T", "Y"]
    ],
    0: [" "],
    1: ["A", "E", "K", "T", "Á", "L", "N", "R", "I", "M", "O", "S"],
    2: ["B", "D", "G", "Ó"],
    3: ["É", "H", "SZ", "V"],
    4: ["F", "GY", "J", "Ö", "P", "U", "Ü", "Z"],
    5: ["C", "Í", "NY"],
    7: ["CS", "Ő", "Ú", "Ű"],
    8: ["LY", "ZS"],
    10: ["TY"]
  },
  pol: {
    displayName: "polski",
    0: [" "],
    1: ["A", "I", "E", "O", "N", "Z", "R", "S", "W"],
    2: ["Y", "C", "D", "K", "L", "M", "P", "T"],
    3: ["B", "G", "H", "J", "Ł", "U"],
    5: ["Ą", "Ę", "F", "Ó", "Ś", "Ż"],
    6: ["Ć"],
    7: ["Ń"],
    9: ["Ź"]
  },
  por: {
    displayName: "português",
    0: [" "],
    1: ["A", "E", "I", "O", "S", "U", "M", "R", "T"],
    2: ["D", "L", "C", "P"],
    3: ["N", "B", "Ç"],
    4: ["F", "G", "H", "V"],
    5: ["J"],
    6: ["Q"],
    8: ["X", "Z"]
  },
  rus: {
    displayName: "русский",
    0: [" "],
    1: ["О", "А", "Е", "И", "Н", "Р", "С", "Т", "В"],
    2: ["Д", "К", "Л", "П", "У", "М"],
    3: ["Б", "Г", "Ь", "Я", "Ё"],
    4: ["Ы", "Й"],
    5: ["З", "Ж", "Х", "Ц", "Ч"],
    8: ["Ш", "Э", "Ю"],
    10: ["Ф", "Щ", "Ъ"]
  },
  ukr: {
    displayName: "українська",
    0: [" "],
    1: ["О", "А", "И", "Н", "В", "Е", "І", "Т", "Р"],
    2: ["К", "С", "Д", "Л", "М", "П"],
    3: ["У"],
    4: ["З", "Я", "Б", "Г"],
    5: ["Ч", "Х", "Й", "Ь"],
    6: ["Ж", "Ї", "Ц", "Ш"],
    7: ["Ю"],
    8: ["Є", "Ф", "Щ"],
    10: ["Ґ", "'"]
  }
};
