export const MIN_LETTER_SCORE_MULTIPLIER = 1;
export const MAX_LETTER_SCORE_MULTIPLIER = 3;
export const POINTS_FOR_BINGO = 50;
export const MINIMUM_LETTERS_FOR_BINGO = 7;

export const SCORE_TABLE = {
  DE: {
    displayName: "Deutsch",
    0: [" "],
    1: ["E", "N", "S", "I", "R", "T", "U", "A", "D"],
    2: ["H", "G", "L", "O"],
    3: ["M", "B", "W", "Z"],
    4: ["C", "F", "K", "P"],
    5: [],
    6: ["Ä", "J", "Ü", "V"],
    7: [],
    8: ["Ö", "X"],
    9: [],
    10: ["Q", "Y"]
  },
  EN: {
    displayName: "English",
    0: [" "],
    1: ["E", "A", "I", "O", "N", "R", "T", "L", "S", "U"],
    2: ["D", "G"],
    3: ["B", "C", "M", "P"],
    4: ["F", "H", "V", "W", "Y"],
    5: ["K"],
    6: [],
    7: [],
    8: ["J", "X"],
    9: [],
    10: ["Q", "Z"]
  },
  ES: {
    displayName: "español",
    digraphs: [
      ["C", "H"],
      ["L", "L"],
      ["R", "R"]
    ],
    0: [" "],
    1: ["A", "E", "O", "I", "S", "N", "R", "U", "L", "T"],
    2: ["D", "G"],
    3: ["C", "B", "M", "P"],
    4: ["H", "F", "V", "Y"],
    5: ["CH", "Q"],
    6: [],
    7: [],
    8: ["J", "LL", "Ñ", "RR", "X"],
    9: [],
    10: ["Z"]
  },
  FR: {
    displayName: "français",
    0: [" "],
    1: ["E", "A", "I", "N", "O", "R", "S", "T", "U", "L"],
    2: ["D", "M", "G"],
    3: ["B", "C", "P"],
    4: ["F", "H", "V"],
    5: [],
    6: [],
    7: [],
    8: ["J", "Q"],
    9: [],
    10: ["K", "W", "X", "Y", "Z"]
  },
  IT: {
    displayName: "italiano",
    0: [" "],
    1: ["O", "A", "I", "E"],
    2: ["C", "R", "S", "T"],
    3: ["L", "M", "N", "U"],
    4: [],
    5: ["B", "D", "F", "P", "V"],
    6: [],
    7: [],
    8: ["G", "H", "Z"],
    9: [],
    10: ["Q"]
  },
  HU: {
    displayName: "magyar",
    digraphs: [
      ["S", "Z"],
      ["G", "Y"],
      ["N", "Y"],
      ["C", "S"],
      ["L", "Y"],
      ["Z", "S"],
      ["T", "Y"]
    ],
    0: [" "],
    1: ["A", "E", "K", "T", "Á", "L", "N", "R", "I", "M", "O", "S"],
    2: ["B", "D", "G", "Ó"],
    3: ["É", "H", "SZ", "V"],
    4: ["F", "GY", "J", "Ö", "P", "U", "Ü", "Z"],
    5: ["C", "Í", "NY"],
    6: [],
    7: ["CS", "Ő", "Ú", "Ű"],
    8: ["LY", "ZS"],
    9: [],
    10: ["TY"]
  },
  PL: {
    displayName: "polski",
    0: [" "],
    1: ["A", "I", "E", "O", "N", "Z", "R", "S", "W"],
    2: ["Y", "C", "D", "K", "L", "M", "P", "T"],
    3: ["B", "G", "H", "J", "Ł", "U"],
    4: [],
    5: ["Ą", "Ę", "F", "Ó", "Ś", "Ż"],
    6: ["Ć"],
    7: ["Ń"],
    8: [],
    9: ["Ź"],
    10: []
  },
  PT: {
    displayName: "português",
    0: [" "],
    1: ["A", "E", "I", "O", "S", "U", "M", "R", "T"],
    2: ["D", "L", "C", "P"],
    3: ["N", "B", "Ç"],
    4: ["F", "G", "H", "V"],
    5: ["J"],
    6: ["Q"],
    7: [],
    8: ["X", "Z"],
    9: [],
    10: []
  },
  RU: {
    displayName: "русский",
    0: [" "],
    1: ["О", "А", "Е", "И", "Н", "Р", "С", "Т", "В"],
    2: ["Д", "К", "Л", "П", "У", "М"],
    3: ["Б", "Г", "Ь", "Я", "Ё"],
    4: ["Ы", "Й"],
    5: ["З", "Ж", "Х", "Ц", "Ч"],
    6: [],
    7: [],
    8: ["Ш", "Э", "Ю"],
    9: [],
    10: ["Ф", "Щ", "Ъ"]
  },
  UA: {
    displayName: "українська",
    0: [" "],
    1: ["О", "А", "И", "Н", "В", "Е", "І", "Т", "Р"],
    2: ["К", "С", "Д", "Л", "М", "П"],
    3: ["У"],
    4: ["З", "Я", "Б", "Г"],
    5: ["Ч", "Х", "Й", "Ь"],
    6: ["Ж", "Ї", "Ц", "Ш"],
    7: ["Ю"],
    8: ["Є", "Ф", "Щ"],
    9: [],
    10: ["Ґ", "'"]
  }
};
